// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.Write("Введите первое число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int number2 = Convert.ToInt32(Console.ReadLine());
// if(number1 >= number2)
// {
//     Console.WriteLine("Наибольшее число: " + number1);
//     Console.WriteLine("Наименьшее число: " + number2);
// }
// else
// {
//     Console.WriteLine("Наибольшее число: " + number2);
//     Console.WriteLine("Наименьшее число: " + number1);
// }

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.Write("Введите первое число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int number2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int number3 = Convert.ToInt32(Console.ReadLine());

// int max_number = number1;

// if(number2 > max_number)
// {
//     max_number = number2;
// }

// if(number3 > max_number)
// {
//     max_number = number3;
// }
// Console.WriteLine("Максимальное значение из введенных чисел: " + max_number);

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.Write("Введите число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// if(number1 % 2 == 0)
// {
//     Console.WriteLine("Введенное число является четным");
// }
// else
// {
//     Console.WriteLine("Введенное число является нечетным");
// }

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// Console.Write("Введите число: ");
// int N = Convert.ToInt32(Console.ReadLine());
// int count = 1;
// while(count <= N)
// {
//     if(count % 2 == 0)
//     {
//         Console.Write(count);
//     }
//     count = count + 1;    
// }